package day5.Reference;
// 문제 : 레퍼런스변수에 값 할당과정 설명
public class ReferenceExam2 {
//    public static void main(String[] args) {
//        // 설명 -> 자동차 class로 이동하기 위해 레퍼런스 변수 a자동차를 선언.
//        //ex) 메인 함수가 시작되면 a자동차라는 변수가 스택 영역에 만들어진다.
//        //ex) a자동차 변수는 자동차 타입이기 때문에 자동차 리모컨만 들어올 수 있다.
//        //ex) 현재는 아무것도 넣지 않았기 때문에 비어있다고 볼 수 있다.
//        자동차 a자동차;
//
//        // 설명 -> 자동차 class의 객체를 생성하고 이 객체의 참조를 a자동차 레퍼런스 변수에 할당,
//        //a자동차는 이제 자동차 class의 객체를 가르킨다.
//        //ex) new 자동차()를 하면 힙에 자동차 클래스를 본 딴 객체가 힙에 만들어진다.
//        //ex) 그와 동시에 객체를 조종할 수 있는(연결되어 있는) 이모컨도 함께 만들어진다.
//        //ex) 리모컨은 스택에 저장할 수 있기 때문에 a자동차 변수에 저장한다.
//        a자동차 = new 자동차();
//
//        // 설명 -> a자동차가 참조하는 자동차 클래스 안의 달리다() 메서드를 호출한다.
//        //ex) a자동차에 있는 리모컨을 이용해서 연결된 자동차에 명령을 내린다.
//        //ex) 연결된 객체(자동차)가 작동한다.
//        a자동차.달리다();
//
//        // 모든 객체들은 서로를 평생 볼 수 없다.
//        // 모든 객체들은 서로를 원격조종한다.
//    }
}

// 자동차 설계도!, 절대 자동차가 아니다.!!!
//class 자동차 {
//    // 이 메서드(함수)의 2가지 용도
//    // - ??? a자동차의 상태변경
//    // - ???
//    void 달리다() {
//        System.out.println("자동차가 달립니다.");
//    }
//}
